[
    {
        "start": "2022",
        "end": "2022",
        "company": "AdTonos",
        "position": "Senior Fullstack Developer",
        "summary": "I was working on a high-workload system that delivers ads to players. It handles more than 600 mln requests daily and all of them are delivered super fast to a player. System is written mostly in Node.js. Unfortunatelly due to unexpected bad company's financial condition we decided to terminate our contract.",
        "stack": ["JavaScript", "TypeScript", "Angular", "Node.js", "Fastify", "MongoDB", "Ansible", "Linux"]
    },
    {
        "start": "2020",
        "end": "2022",
        "company": "Commerzbank AG",
        "position": "Senior Fullstack Developer + Cloud Architect",
        "summary": "My main responsibility was to deliver software for internal bank's stakeholders. Due to company's strategy, one of main points of focus was to switch with software to cloud solutions. I supported company with that movement in projects I worked in and a couple of more that needed support. Responsibilities I took part in consisted of Python development with a frontend written in React and deploying it to Google Cloud Platform using Kubernetes. Second project was a data-heavy search engine to find best matching client based on as few parameters as possible, that were mistake tolerant and were deliver blazingly fast.",
        "stack": [
            "JavaScript",
            "TypeScript",
            "React",
            "Python",
            "Flask",
            "PostgreSQL",
            "Google Cloud Services",
            "Serverless",
            "Terraform",
            "Kubernetes",
            "Linux"
        ]
    },
    {
        "start": "2018",
        "end": "2020",
        "company": "NX Labs",
        "position": "Senior Fullstack Developer + DevOps",
        "summary": "This company is an inside \"software house\", that creates MVP solutions based on businessmen ideas to try them on market. I prepared architectural solutions, created software using multiple technologies - frontend and backend and mobile sides, to finally launch it inside cloud infrastructure that I also prepared",
        "stack": [
            "PHP",
            "Zend Framework",
            "JavaScript",
            "TypeScript",
            "jQuery",
            "React",
            "React Native",
            "Python",
            "Flask",
            "Sanic",
            "MySQL",
            "PostgreSQL",
            "Amazon Web Services",
            "Linux"
        ]
    },
    {
        "start": "2016",
        "end": "2018",
        "company": "STX Next",
        "position": "Senior Fullstack Developer",
        "summary": "I was working in a software house, which delivers many international projects. Some of technologies I worked with: Python 3, AngularJS, React, React Native, GraphQL, relational databases like MySQL and PostgreSQL and AWS platform. I also ran a couple of workshops, both internal and external",
        "stack": [
            "JavaScript",
            "TypeScript",
            "jQuery",
            "AngularJS",
            "React",
            "React Native",
            "Python",
            "Django",
            "Flask",
            "GraphQL",
            "PostgreSQL",
            "MySQL",
            "Amazon Web Services",
            "Linux",
            "Docker"
        ]
    },
    {
        "start": "2015",
        "end": "2016",
        "company": "Gromar Sp. z o. o.",
        "position": "Fullstack Developer",
        "summary": "I was responsible for developing and maintaining e-learning application LearnWay, on backend side using PHP and PostgreSQL, and on the frontend side using AngularJS and jQuery. Moreover, I was building solutions to contenerize applications using Docker",
        "stack": ["PHP", "Symfony", "JavaScript", "jQuery", "AngularJS", "React", "PostgreSQL", "Linux", "Docker"]
    }
]
